Tekla Open API Reference for Tekla Structures 2025
BoltGroup.BoltRotateSlotsEnum Enumeration
 The rotation of the slots (the holes).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum BoltRotateSlotsEnum
Public Enumeration BoltRotateSlotsEnum
Members
Member name | Value | Description
ROTATE_SLOTS_ODD | 0 |  The slots are crossed to odd parts.
ROTATE_SLOTS_EVEN | 1 |  The slots are crossed to even parts.
ROTATE_SLOTS_PARALLEL | 2 |  The slots are rotated to be parallel.
See Also
Reference
Tekla.Structures.Model Namespace